order-service/app/models/line_item.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 8]]
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", "-1001.0"], ["updated_at", "2023-11-28 09:26:05.643167"], ["id", 8]]
---
  def update_total_price
    updated_price = self.order.line_items.sum do |item|
      item.price * item.quantity
    end

    self.order.update(total_price: updated_price)