order-service/app/controllers/orders_controller.rb

  def index
    product_ids = @order.line_items.pluck(:product_id)
    products = ProductClient.get_products(product_ids)
    products.map! do |product|
      line_item = @order.line_items.find_by(product_id: product["id"])
---
SELECT "line_items"."product_id" FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 8]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["order_id", 8], ["product_id", "0"], ["LIMIT", 1]]

  def destroy
    line_item = @order.line_items.find_by(product_id: order_params[:product_id])
    line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["order_id", 1], ["product_id", 22], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 2]]

  def update
    line_item = @order.line_items.find_by(product_id: order_params[:product_id])
    line_item.update(quantity: order_params[:quantity])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["order_id", 8], ["product_id", "49"], ["LIMIT", 1]]
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", "32993639234.38"], ["updated_at", "2023-11-29 06:40:13.183145"], ["id", 8]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 66], ["updated_at", "2023-11-28 07:17:14.804984"], ["id", 18]]

  def add_to_cart
    order = Order.find_or_initialize_by(user_id: @current_user_id, status: 'CART')
    line_item = order.line_items.find_by(product_id: order_params[:product_id])

    if line_item
      line_item.update(quantity: line_item[:quantity] + order_params[:quantity])
    else
      order.line_items.build(order_params)
      order.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["user_id", 8], ["status", "CART"], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3  [["order_id", 8], ["product_id", "49"], ["LIMIT", 1]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 141], ["updated_at", "2023-11-29 09:00:40.641569"], ["id", 31]]
INSERT INTO "orders" ("user_id", "status", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 8], ["status", "CART"], ["total_price", nil], ["created_at", "2023-11-29 09:25:25.463284"], ["updated_at", "2023-11-29 09:25:25.463284"]]
INSERT INTO "line_items" ("product_id", "price", "quantity", "created_at", "updated_at", "order_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_id", 22], ["price", "86.62"], ["quantity", 1], ["created_at", "2023-11-29 09:30:53.028234"], ["updated_at", "2023-11-29 09:30:53.028234"], ["order_id", 1]]

  def set_order
    @order = Order.find_by(user_id: @current_user_id, status: 'CART')
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["user_id", 8], ["status", "CART"], ["LIMIT", 1]]